# ThumbnailFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MaterialNode..::..ThumbnailFile Property
MaterialNode Class See Also
---
The path if a file that contains a thumbnail image of the material.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string ThumbnailFile { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ThumbnailFile As String
	Get
```

Visual C++
---
```text
public:
property String^ ThumbnailFile {
	String^ get ();
}
```

# See Also
MaterialNode Class
Autodesk.Revit.DB Namespace